public_html/zha.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-20 vie 12:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>zha</title>
<meta name="author" content="Sherlockes" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='https://gongzhitaao.org/orgcss/org.css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">zha</h1>
<p>
La integración ZHA permite conectar dispositivos Zigbee a <a href="home_assistant.html#ID-42e68ab8-cffa-4b48-9974-dfd9a9ebb694">Home Assistant</a> de forma inalámbrica usando coordinadores Zigbee. Emplea la biblioteca zigpy de <a href="python.html#ID-06032c9e-2664-4b4d-9bd3-ed72e16768a1">Python</a> para implementar una pila Zigbee independiente del hardware. Todos los coordinadores compatibles con zigpy son utilizables con ZHA.
</p>
<!--more-->

<div id="outline-container-org05bfaf1" class="outline-2">
<h2 id="org05bfaf1"><span class="section-number-2">1.</span> Calibración del TS130F para las persianas</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgac98dca" class="outline-3">
<h3 id="orgac98dca"><span class="section-number-3">1.1.</span> Calibración por movimiento</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Este tipo de calibración consiste en activar el modo de calibración y realizar un movimiento de la persiana entre sus extremos siguiendo estos pasos:
</p>
<ul class="org-ul">
<li>En la pestaña "Clústeres" selecciona los clústeres "TuyaCoveringCluster"</li>
<li>En el atributo "Calibration" poner "0" como valor</li>
<li>Escribir atributo para entrar en el modo de calibración</li>
<li>En la pestaña comandos seleccionar "down<sub>close</sub>" y emitir el comando</li>
<li>La persiana empieza a bajar</li>
<li>Seleccionar el comando "stop" y esperar mientras baja la persiana.</li>
<li>Emitir el comando justo cuando llegue a la posición de cerrada.</li>
<li>Seleccionar el comando "up<sub>open</sub>" y emitirlo.</li>
<li>Mientras la persiana sube seleccionar el comando "stop"</li>
<li>Justo cuando la persiana llega arriba emitir el comando "stop"</li>
<li>En el atributo "Calibration" poner "1" como valor</li>
<li>Escribir el atributo para salir del modo de calibración.</li>
</ul>
</div>
</div>
<div id="outline-container-org2a372a0" class="outline-3">
<h3 id="org2a372a0"><span class="section-number-3">1.2.</span> Calibración por tiempo</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Es muy probable que a que la persiana va haciendo varios ciclos de subidas y bajadas esta no llegue a alcanzar una de las posiciones extremas. En este caso realizaremos una recalibración del tiempo de subida/bajada. Para definir los pasos supondremos el caso de que la persiana no llegue a subir del todo.
</p>
<ul class="org-ul">
<li>En la pestaña "Clústeres" selecciona los clústeres "TuyaCoveringCluster"</li>
<li>En la pestaña "Atributos" seleccionamos y leemos "current position lift percentage"</li>
<li>Introducimos y escribimos el porcentaje real de subida para poder seguir subiendo.</li>
<li>Subir la persiana (Si no alcanza la pos superior, repetir el paso anterior)</li>
<li>Leer el atributo "Calibration time" (Décimas de segundo)</li>
<li>Incrementar y escribir el valor con el tiempo que le faltaba para llegar arriba</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-02-08</p>
<p class="author">Author: Sherlockes</p>
<p class="date">Created: 2026-03-20 vie 12:57</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
